In [1]:
import pandas as pd

In [3]:
cr = pd.read_csv('quikr_car.csv')

In [7]:
cr.head()

,name,company,year,Price,kms_driven,fuel_type,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2018,"80,000.0","45,000 kms",Petrol,NaN,NaN,NaN,NaN,NaN
1,Mahindra Jeep CL550 MDI,Mahindra,2019,"4,25,000",40 kms,Diesel,NaN,NaN,NaN,NaN,NaN
2,Maruti Suzuki Alto 800 Vxi,Maruti,2015,"10,000 kms","22,000 kms",Petrol,NaN,NaN,NaN,NaN,NaN
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol,NaN,NaN,NaN,NaN,NaN
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2016,"5,75,000","36,000 kms",Diesel,NaN,NaN,NaN,NaN,NaN

In [6]:
cr.info

<bound method DataFrame.info of                                        name    company  year       Price  \
0      Hyundai Santro Xing XO eRLX Euro III    Hyundai  2018    80,000.0
1                   Mahindra Jeep CL550 MDI   Mahindra  2019    4,25,000
2                Maruti Suzuki Alto 800 Vxi     Maruti  2015  10,000 kms
3    Hyundai Grand i10 Magna 1.2 Kappa VTVT    Hyundai  2014    3,25,000
4          Ford EcoSport Titanium 1.5L TDCi       Ford  2016    5,75,000
..                                      ...        ...   ...         ...
840                    Toyota Corolla Altis     Toyota  2015    3,00,000
841                     Tata Zest XM Diesel       Tata  2016    2,60,000
842                      Mahindra Quanto C8   Mahindra  2015    3,90,000
843                Honda Amaze 1.2 E i VTEC      Honda  2019    1,80,000
844               Chevrolet Sail 1.2 LT ABS  Chevrolet  2018    1,60,000

       kms_driven fuel_type  Unnamed: 6  Unnamed: 7  Unnamed: 8  Unnamed: 9  \
0      45,000 kms    Petrol         NaN         NaN         NaN         NaN
1          40 kms    Diesel         NaN         NaN         NaN         NaN
2      22,000 kms    Petrol         NaN         NaN         NaN         NaN
3      28,000 kms    Petrol         NaN         NaN         NaN         NaN
4      36,000 kms    Diesel         NaN         NaN         NaN         NaN
..            ...       ...         ...         ...         ...         ...
840  1,32,000 kms    Petrol         NaN         NaN         NaN         NaN
841    27,000 kms    Diesel         NaN         NaN         NaN         NaN
842    40,000 kms    Diesel         NaN         NaN         NaN         NaN
843        Petrol    Petrol         NaN         NaN         NaN         NaN
844        Petrol    Diesel         NaN         NaN         NaN         NaN

     Unnamed: 10
0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
..           ...
840          NaN
841          NaN
842          NaN
843          NaN
844          NaN

[845 rows x 11 columns]>

In [13]:
cr.drop(['Unnamed: 7','Unnamed: 8','Unnamed: 9','Unnamed: 10'], axis = 1,inplace = True)

In [24]:
cr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 839 entries, 0 to 844
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        839 non-null    object
 1   company     839 non-null    object
 2   year        839 non-null    int32
 3   Price       839 non-null    object
 4   kms_driven  839 non-null    object
 5   fuel_type   839 non-null    object
dtypes: int32(1), object(5)
memory usage: 42.6+ KB

In [15]:
cr.isnull().sum()

name          0
company       0
year          0
Price         0
kms_driven    6
fuel_type     6
dtype: int64

In [16]:
cr.dropna(inplace = True)

In [17]:
cr.isnull().sum()

name          0
company       0
year          0
Price         0
kms_driven    0
fuel_type     0
dtype: int64

In [18]:
cr.shape

(839, 6)

In [21]:
cr['Price'].unique()

array(['80,000.0', '4,25,000', '10,000 kms', '3,25,000', '5,75,000',
       '1,75,000', '1,90,000', '8,30,000', '2,50,000', '1,82,000',
       '3,15,000', '4,15,000', '3,20,000', '10,00,000', '5,00,000',
       '3,50,000', '1,60,000', '3,10,000', '75,000.0', '1,00,000',
       '2,90,000', '95,000.0', '1,80,000', '3,85,000', '1,05,000',
       '6,50,000', '6,89,999', '4,48,000', '5,49,000', '5,01,000',
       '4,89,999', '2,80,000', '3,49,999', '2,84,999', '3,45,000',
       '4,99,999', '2,35,000', '2,49,999', '14,75,000', '3,95,000',
       '2,20,000', '1,70,000', '85,000.0', '2,00,000', '5,70,000',
       '1,10,000', '4,48,999', '18,91,111', '1,59,500', '3,44,999',
       '4,49,999', '8,65,000', '6,99,000', '3,75,000', '2,24,999',
       '12,00,000', '1,95,000', '3,51,000', '2,40,000', '90,000.0',
       '1,55,000', '6,00,000', '1,89,500', '2,10,000', '3,90,000',
       '1,35,000', '16,00,000', '7,01,000', '2,65,000', '5,25,000',
       '3,72,000', '6,35,000', '5,50,000', '4,85,000', '3,29,500',
       '2,51,111', '5,69,999', '69,999.0', '2,99,999', '3,99,999',
       '4,50,000', '2,70,000', '1,58,400', '1,79,000', '1,25,000',
       '2,99,000', '1,50,000', '2,85,000', '3,40,000', '10,000.0',
       '70,000.0', '2,89,999', '8,49,999', '7,49,999', '2,74,999',
       '9,84,999', '5,99,999', '2,44,999', '4,74,999', '2,45,000',
       '1,69,500', '2,75,000', '3,70,000', '1,68,000', '1,45,000',
       '98,500.0', '2,09,000', '1,85,000', '9,00,000', '6,99,999',
       '1,99,999', '5,44,999', '1,99,000', '5,40,000', '49,000.0',
       '7,00,000', '55,000.0', '8,95,000', '3,55,000', '5,65,000',
       '3,65,000', '40,000.0', '4,00,000', '3,30,000', '5,80,000',
       '3,79,000', '2,19,000', '5,19,000', '7,30,000', '20,00,000',
       '21,00,000', '14,00,000', '3,11,000', '8,55,000', '5,35,000',
       '1,78,000', '3,00,000', '2,55,000', '5,49,999', '3,80,000',
       '57,000.0', '4,10,000', '2,25,000', '1,20,000', '59,000.0',
       '5,99,000', '6,75,000', '72,500.0', '6,10,000', '2,30,000',
       '5,20,000', '5,24,999', '4,24,999', '6,44,999', '5,84,999',
       '7,99,999', '4,44,999', '6,49,999', '9,44,999', '5,74,999',
       '3,74,999', '1,30,000', '4,01,000', '13,50,000', '1,74,999',
       '2,39,999', '99,999.0', '3,24,999', '10,74,999', '11,30,000',
       '1,49,000', '7,70,000', '30,000.0', '3,35,000', '3,99,000',
       '65,000.0', '1,69,999', '1,65,000', '5,60,000', '9,50,000',
       '7,15,000', '45,000.0', '9,40,000', '1,55,555', '15,00,000',
       '4,95,000', '8,00,000', '12,99,000', '5,30,000', '14,99,000',
       '32,000.0', '4,05,000', '7,60,000', '7,50,000', '4,19,000',
       '1,40,000', '15,40,000', '1,23,000', '4,98,000', '4,80,000',
       '4,88,000', '15,25,000', '5,48,900', '7,25,000', '99,000.0',
       '52,000.0', '28,00,000', '4,99,000', '3,81,000', '2,78,000',
       '6,90,000', '2,60,000', '90,001.0', '1,15,000', '15,99,000',
       '1,59,000', '51,999.0', '2,15,000', '35,000.0', '11,50,000',
       '2,69,000', '60,000.0', '4,30,000', '85,00,003', '4,01,919',
       '4,90,000', '4,24,000', '2,05,000', '5,49,900', '4,35,000',
       '1,89,700', '3,89,700', '3,60,000', '2,95,000', '1,14,990',
       '10,65,000', '4,70,000', '48,000.0', '1,88,000', '4,65,000',
       '1,79,999', '21,90,000', '23,90,000', '10,75,000', '4,75,000',
       '10,25,000', '6,15,000', '19,00,000', '14,90,000', '15,10,000',
       '18,50,000', '7,90,000', '17,25,000', '12,25,000', '68,000.0',
       '9,70,000', '31,00,000', '8,99,000', '88,000.0', '53,000.0',
       '5,68,500', '71,000.0', '5,90,000', '7,95,000', '42,000.0',
       '1,89,000', '1,62,000', '35,999.0', '29,00,000', '39,999.0',
       '10,000,00', '50,500.0', '5,10,000', '8,60,000', '5,00,001'],
      dtype=object)

In [39]:
cr['Price'] = cr['Price'].str.replace(',' , '' )

In [38]:
cr[cr['Price']!= "10000 kms"]

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2018,80000.0,"45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2019,425000,40 kms,Diesel
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,325000,"28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2016,575000,"36,000 kms",Diesel
6,Ford Figo,Ford,2016,175000,"41,000 kms",Diesel
...,...,...,...,...,...,...
840,Toyota Corolla Altis,Toyota,2015,300000,"1,32,000 kms",Petrol
841,Tata Zest XM Diesel,Tata,2016,260000,"27,000 kms",Diesel
842,Mahindra Quanto C8,Mahindra,2015,390000,"40,000 kms",Diesel
843,Honda Amaze 1.2 E i VTEC,Honda,2019,180000,Petrol,Petrol
844,Chevrolet Sail 1.2 LT ABS,Chevrolet,2018,160000,Petrol,Diesel

In [45]:
cr['kms_driven'] = cr['kms_driven'].str.split('').str.get(0).str.replace(',','')

In [55]:
cr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        0 non-null      object
 1   company     0 non-null      object
 2   year        0 non-null      int32
 3   Price       0 non-null      int32
 4   kms_driven  0 non-null      int32
 5   fuel_type   0 non-null      object
dtypes: int32(3), object(3)
memory usage: 0.0+ bytes

In [48]:
cr = cr[cr['kms_driven'].str.isnumeric()]

In [49]:
cr['kms_driven'] = cr['kms_driven'].astype(int)

In [51]:
cr = cr[cr['Price'].str.isnumeric()]

In [52]:
cr['Price'] = cr['Price'].astype(int)

In [53]:
cr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        0 non-null      object
 1   company     0 non-null      object
 2   year        0 non-null      int32
 3   Price       0 non-null      int32
 4   kms_driven  0 non-null      int32
 5   fuel_type   0 non-null      object
dtypes: int32(3), object(3)
memory usage: 0.0+ bytes

In [54]:
cr.head()

Empty DataFrame
Columns: [name, company, year, Price, kms_driven, fuel_type]
Index: []